HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_28_dci.c
/*******************************************************************************
 * d/q 轴 PI 配置（P 重调阶段：i_valid=false 纯 P，ki=0。
 * 转子捏死工况下调 P：快速接近目标且不振铃即为合格。
 * P 合格后 Watch 置 i_valid=1 + ki=DCI_PI_KI；字段 volatile 实时生效）
 ******************************************************************************/
pid_config_t g_dci_pid_id_cfg = {
    .enabled      = true,
    .p_valid      = true,
    .i_valid      = false,          /* P 重调阶段；P 合格后 Watch 置 1 开 I */
    .d_valid      = false,
    .kp           = DCI_PI_KP,
    .ki           = 0.0f,           /* 开 I 时 Watch 改为 DCI_PI_KI（≈kp×R/L） */
    .kd           = 0.0f,
    .output_min   = -DCI_PI_UMAX_V,
    .output_max   =  DCI_PI_UMAX_V,
    .integral_max =  DCI_ITERM_MAX_V,
    .i_term_max   =  DCI_ITERM_MAX_V,
    .update_ms    = 0,
};

pid_config_t g_dci_pid_iq_cfg = {
    .enabled      = true,
    .p_valid      = true,
    .i_valid      = false,          /* P 重调阶段；P 合格后 Watch 置 1 开 I */
    .d_valid      = false,
    .kp           = DCI_PI_KP,
    .ki           = 0.0f,
    .kd           = 0.0f,
    .output_min   = -DCI_PI_UMAX_V,
    .output_max   =  DCI_PI_UMAX_V,
    .integral_max =  DCI_ITERM_MAX_V,
    .i_term_max   =  DCI_ITERM_MAX_V,
    .update_ms    = 0,
};

/* PI runtime states */
static pid_state_t s_pid_id;
static pid_state_t s_pid_iq;

/*******************************************************************************
 * 内部助手：峰峰值喂数（ISR 内调用）
 *   每拍更新窗口内 min/max，满 DCI_PP_WIN_TICKS 时锁存峰峰值并以下一拍
 *   样本为新窗口起点（窗口无缝衔接，无重叠无遗漏）。入参单位 A。
 ******************************************************************************/
static void Dci_PpFeed(float id, float iq)
{
    if (s_pp_init == 0u) {
        s_id_min = s_id_max = id;
        s_iq_min = s_iq_max = iq;
        s_pp_init = 1u;
    } else {
        if (id < s_id_min) { s_id_min = id; }
        if (id > s_id_max) { s_id_max = id; }
        if (iq < s_iq_min) { s_iq_min = iq; }
        if (iq > s_iq_max) { s_iq_max = iq; }
    }
    if (++s_pp_tick >= DCI_PP_WIN_TICKS) {
        s_pp_tick = 0u;
        g_dci_id_pp_ma = (s_id_max - s_id_min) * 1000.0f;
        g_dci_iq_pp_ma = (s_iq_max - s_iq_min) * 1000.0f;
        s_id_min = s_id_max = id;   /* 新窗口从当前样本重新起步 */
        s_iq_min = s_iq_max = iq;
    }
}

/*******************************************************************************
 * 内部助手：输出指定磁场电角度 + 刷新观测量（ISR 内调用）
 *   入参 fa = 磁场角（本模式的主控制变量 = 转子角 + delta）。
 *   valpha=V·cos(fa), vbeta=V·sin(fa)；
 *   等效 d 轴角 theta = fa - 90°（g_foc_theta_rad 语义与 mode 26/27 统一），
 *   锁相稳态时控制系电流 g_foc_id_ma≈0, g_foc_iq_ma≈I。
 *   电流入参 p 为零偏校正后的 dataCal 副本。
 ******************************************************************************/
static void Dci_OutputField(const stc_i_data_t *p, float fa)
{
    float valpha, vbeta, du, dv, dw, id, iq, th;

    valpha = g_dci_volt_v * Foc_Math_Cos(fa);
    vbeta  = g_dci_volt_v * Foc_Math_Sin(fa);
    Foc_Svpwm(valpha, vbeta, FOC_VBUS_V, &du, &dv, &dw);
    TMR4_PWM_SetDuty3Phase(du, dv, dw);

    th = fa - FOC_MATH_HALF_PI;
    th -= (float)((int32_t)(th * (1.0f / FOC_MATH_2PI))) * FOC_MATH_2PI;
    if (th < 0.0f) {
        th += FOC_MATH_2PI;
    }

    g_foc_valpha    = valpha;
    g_foc_vbeta     = vbeta;
    g_foc_vd        = valpha;
    g_foc_vq        = vbeta;
    g_foc_theta_rad = th;
    g_foc_du        = du;
    g_foc_dv        = dv;
    g_foc_dw        = dw;
    g_dci_du        = du;
    g_dci_dv        = dv;
    g_dci_dw        = dw;

    /* 控制系（theta d 轴框架）电流观察：锁相稳态 id≈0, iq≈I */
    Foc_Core_GetDq(p, th, &id, &iq);
    g_foc_id_ma = id * 1000.0f;
    g_foc_iq_ma = iq * 1000.0f;
}

/*******************************************************************************
 * Foc_Dci_InitPids - 绑定 PI 实例与配置（Foc_Init 调用一次）
 ******************************************************************************/
void Foc_Dci_InitPids(void)
{
    PID_Init(&s_pid_id, &g_dci_pid_id_cfg);
    PID_Init(&s_pid_iq, &g_dci_pid_iq_cfg);
}

/*******************************************************************************
 * Foc_Dci_Start - mode 28 入口：校准 + 闭环 一体化（主循环上下文，允许打印）
 ******************************************************************************/
void Foc_Dci_Start(void)
{
    Foc_Core_ClearFault();
    g_foc_mode        = FOC_MODE_ALIGN;   /* 复用 ALIGN 分发路径（按 g_dci_running 区分） */
    g_foc_phase       = 4u;
    g_foc_theta_rad   = FOC_MATH_HALF_PI;
    g_foc_id_ma       = 0.0f;
    g_foc_iq_ma       = 0.0f;
    g_foc_vd          = 0.0f;
    g_foc_vq          = 0.0f;

    Foc_Core_SetStateMachine(FOC_STATE_ALIGN);
    Foc_Core_ResetVoltageEnvelope();
    Foc_Core_ResetEma();
    g_foc_align_state = 1u;

    g_dci_running     = 1u;
    g_dci_state       = DCI_STEP_CALIB;
    g_dci_evt         = 0u;
    s_phase_tick      = 0u;
    s_run_tick        = 0u;
    s_ramp_done       = 0u;
    s_i_ref_ramp      = 0.0f;
    s_enc_init        = 0u;
    s_enc_pos         = 0;
    s_off_rel         = 0;
    s_speed_tick      = 0u;
    s_speed_acc       = 0;
    g_dci_dlt_now_deg = g_dci_dlt_init_deg;
    g_dci_speed_hz    = 0.0f;
    g_dci_field_deg   = 0;
    g_dci_rotor_deg   = 0;
    g_dci_diff_deg    = 0;
    g_dci_id_ma       = 0.0f;
    g_dci_iq_ma       = 0.0f;
    g_dci_id_pp_ma    = 0.0f;
    g_dci_iq_pp_ma    = 0.0f;
    g_dci_id_mean_ma  = 0.0f;
    g_dci_iq_mean_ma  = 0.0f;
    g_dci_id_ref_ma   = 0.0f;
    g_dci_iq_ref_ma   = 0.0f;
    g_dci_vsat        = 0u;
    g_dci_ed_mean_ma  = 0.0f;
    g_dci_eq_mean_ma  = 0.0f;
    g_dci_ed_pp_ma    = 0.0f;
    g_dci_eq_pp_ma    = 0.0f;
    s_pp_tick         = 0u;
    s_pp_init         = 0u;
    s_mean_tick       = 0u;
    s_id_sum_ma       = 0;
    s_iq_sum_ma       = 0;
    s_err_tick        = 0u;
    s_err_init        = 0u;
    s_ed_sum_ma       = 0;
    s_eq_sum_ma       = 0;
    /* g_dci_i_ref_ma 不复位（力矩旋钮，预设后启动） */
    PID_Reset(&s_pid_id);   /* 清 PI 累计（积分/首拍标志） */
    PID_Reset(&s_pid_iq);
    g_dci_enc_pos     = 0;
    g_dci_volt_v      = 0.6f;
    /* g_dci_offset 保留上次锁定值（校准完成后覆盖刷新） */

    Foc_Calib_Start();     /* 零偏校准状态机复位，CALIB 态逐拍喂样 */
    Foc_Core_PwmStart();   /* 零矢量起 PWM（g_foc_active=1），下一拍开始校准 */

    DCI_DBG("start calib zero-offset -> run dlt %d->%d deg tr=%d ms Iref=%d mA kp=%d m iValid=%d",
            (int)g_dci_dlt_init_deg, (int)g_dci_dlt_targ_deg,
            (int)g_dci_dlt_tr_ms, (int)g_dci_i_ref_ma,
            (int)(g_dci_pid_iq_cfg.kp * 1000.0f),
            (int)g_dci_pid_iq_cfg.i_valid);
}

