HCHCHC99/WS_L_re/ws_L_v.inmop_curloop_re/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/ws/foc_28_dci.c
/*******************************************************************************
 * Foc_Dci_Step - 步进（20 kHz ISR 中调用，禁止打印）
 ******************************************************************************/
void Foc_Dci_Step(const stc_i_data_t *pData)
{
    float rot_rad, id, iq, w, dlt, dlt_rad, ramp_step;
    float id_ref, iq_ref, vd, vq, valpha, vbeta, du, dv, dw, cos_r, sin_r;
    uint16_t hw, hw0;
    uint32_t tr_ticks;
    int32_t delta, rel, rot_deg, fld_deg, dfd, dir;
    stc_i_data_t dataCal;   /* 零偏校正后的电流采样副本（OC 保护仍用原始 pData） */

    /* ===== OC 保护（原始 pData，去抖在 Foc_Core_OverCurrent 内） ===== */
    if (Foc_Core_OverCurrent(pData)) {
        g_dci_state   = DCI_STEP_FAULT_OC;
        g_dci_evt     = DCI_EVT_OC;
        g_dci_running = 0u;
        Foc_Core_FaultStop(1u);   /* 置故障 + 关 PWM + active=0 + IDLE */
        return;
    }

    /* ===== 零偏校正副本（foc_calib 未锁定时全 0 偏移 = 原始值） ===== */
    dataCal = *pData;
    if (Foc_Calib_IsLocked()) {
        float off_u, off_v, off_w;
        Foc_Calib_GetOffsetsMa(&off_u, &off_v, &off_w);
        dataCal.i16IU_mA = (int16_t)((float)pData->i16IU_mA - off_u);
        dataCal.i16IV_mA = (int16_t)((float)pData->i16IV_mA - off_v);
        dataCal.i16IW_mA = (int16_t)((float)pData->i16IW_mA - off_w);
    }

    switch (g_dci_state) {
    /* ===== 零矢量零偏校准：三相 50/50/50（零电流），~210ms ===== */
    case DCI_STEP_CALIB:
        (void)Foc_Calib_Feed(pData);
        TMR4_PWM_SetDuty3Phase(50.0f, 50.0f, 50.0f);
        g_foc_du = 50.0f;
        g_foc_dv = 50.0f;
        g_foc_dw = 50.0f;
        g_dci_du = 50.0f;
        g_dci_dv = 50.0f;
        g_dci_dw = 50.0f;
        g_foc_id_ma = 0.0f;
        g_foc_iq_ma = 0.0f;
        g_foc_vd = 0.0f;
        g_foc_vq = 0.0f;
        if (Foc_Calib_IsLocked()) {
            s_phase_tick = 0u;
            g_dci_state  = DCI_STEP_CAL_BETA;
            g_dci_evt    = DCI_EVT_CALIB_DONE;
        }
        break;

    /* ===== 校准 BETA：磁场定 90°，2s ===== */
    case DCI_STEP_CAL_BETA:
        Dci_OutputField(&dataCal, FOC_MATH_HALF_PI);
        if (++s_phase_tick >= DCI_BETA_TICKS) {
            s_phase_tick = 0u;
            g_dci_state  = DCI_STEP_CAL_ALPHA;
            g_dci_evt    = DCI_EVT_BETA_DONE;
        }
        break;

    /* ===== 校准 ALPHA：磁场定 0°，2s，结束锁零点 -> 功角闭环 ===== */
    case DCI_STEP_CAL_ALPHA:
        Dci_OutputField(&dataCal, 0.0f);
        if (++s_phase_tick >= DCI_ALPHA_TICKS) {
            /* 锁零点（双帧）：
             *  - 控制帧：s_off_rel = 此刻相对计数，RUN 态转子电角 =
             *    mod((s_enc_pos - s_off_rel) × dir, CPR)，锁相瞬间 = 0
             *  - 显示帧：g_dci_offset = hw 绝对帧（与 mode 20/25/26/27 同框架，
             *    便于跨模式/跨次对比） */
            hw0 = TMRA_GetCountValue(CM_TMRA_1);
            dir = (int32_t)g_foc_enc_dir;
            g_dci_offset = Foc_Core_ModPos((int32_t)hw0 * dir,
                                           (int32_t)ENCODER_CPR);
            Foc_Core_SetAlignOffset(g_dci_offset);   /* core 共享角度观测同帧（与 mode 27 一致） */
            s_off_rel     = s_enc_pos;
            s_enc_prev_hw = hw0;      /* 编码器基准锚定在锁零点瞬间 */
            s_enc_init    = 1u;

            s_phase_tick = 0u;
            s_run_tick   = 0u;
            s_ramp_done  = 0u;
            g_dci_state  = DCI_STEP_RUN;
            g_dci_evt    = DCI_EVT_LOCKED;
        }
        break;

    /* ===== RUN：磁场 = 转子 + delta（功角闭环核心），与 mode 27 逐拍等价 ===== */
    case DCI_STEP_RUN:
        /* 1. delta 爬坡：value = init + (targ-init)×w，w = elapsed/tr 线性，
         *    init/targ/tr 每拍实时读 Watch（运行中改 = 按新值重算轨迹）。
         *    tr=0 立即到目标；到点置 RAMP_DONE 一次。 */
        tr_ticks = g_dci_dlt_tr_ms * (FOC_ISR_HZ / 1000u);
        if (tr_ticks == 0u) {
            w = 1.0f;
        } else {
            w = (float)s_run_tick / (float)tr_ticks;
            if (w > 1.0f) {
                w = 1.0f;
            }
        }
        dlt = g_dci_dlt_init_deg
            + (g_dci_dlt_targ_deg - g_dci_dlt_init_deg) * w;
        g_dci_dlt_now_deg = dlt;
        if ((s_ramp_done == 0u) && (s_run_tick >= tr_ticks)) {
            s_ramp_done = 1u;
            g_dci_evt   = DCI_EVT_RAMP_DONE;
        }
        s_run_tick++;

        /* 2. 编码器增量读取：wrap-safe 差分 + ±DCI_ENC_DELTA_MAX 限幅
         *    （毛刺单拍污染封顶 ±32 counts ≈ ±2.8° 电角） */
        hw = TMRA_GetCountValue(CM_TMRA_1);
        if (!s_enc_init) {
            s_enc_prev_hw = hw;
            s_enc_init    = 1u;
        }
        delta = (int32_t)(int16_t)((uint16_t)hw - s_enc_prev_hw);
        s_enc_prev_hw = hw;
        if (delta > DCI_ENC_DELTA_MAX) {
            delta = DCI_ENC_DELTA_MAX;
        }
        if (delta < -DCI_ENC_DELTA_MAX) {
            delta = -DCI_ENC_DELTA_MAX;
        }
        s_enc_pos += delta;
        g_dci_enc_pos = s_enc_pos;

        /* 3. 转子真实电角度（相对帧 - 锁零点，机械圈 -> 电角度） */
        rel = Foc_Core_ModPos((s_enc_pos - s_off_rel) * (int32_t)g_foc_enc_dir,
                              (int32_t)ENCODER_CPR);
        rot_rad = (float)rel * (FOC_MATH_2PI * (float)FOC_POLE_PAIRS
                                / (float)ENCODER_CPR);
        rot_rad -= (float)((int32_t)(rot_rad * (1.0f / FOC_MATH_2PI))) * FOC_MATH_2PI;
        if (rot_rad < 0.0f) {
            rot_rad += FOC_MATH_2PI;
        }

        /* 4. 电流环反馈：真实转子系 id/iq（零偏校正后；RUN 控制系 = 转子系） */
        Foc_Core_GetDq(&dataCal, rot_rad, &id, &iq);
        g_dci_id_ma = id * 1000.0f;
        g_dci_iq_ma = iq * 1000.0f;
        g_foc_id_ma = g_dci_id_ma;
        g_foc_iq_ma = g_dci_iq_ma;
        Dci_PpFeed(id, iq);   /* 峰峰值统计（5s 窗口刷新） */

        /* 5. 均值统计（3s 窗口刷新，mA 整数累加无浮点误差） */
        s_id_sum_ma += (int32_t)(id * 1000.0f);
        s_iq_sum_ma += (int32_t)(iq * 1000.0f);
        if (++s_mean_tick >= DCI_MEAN_WIN_TICKS) {
            s_mean_tick = 0u;
            g_dci_id_mean_ma = (float)s_id_sum_ma / (float)DCI_MEAN_WIN_TICKS;
            g_dci_iq_mean_ma = (float)s_iq_sum_ma / (float)DCI_MEAN_WIN_TICKS;
            s_id_sum_ma = 0;
            s_iq_sum_ma = 0;
        }

        /* 6. 电流参考生成：先 I_ref 斜坡（每拍小目标逼近最终目标），再
         *    id_ref = I·cosδ, iq_ref = I·sinδ（δ=90° 即 id_ref=0 经典 FOC）。
         *    斜率 g_dci_i_ramp_ma_s (mA/s) Watch 可调，<=0 直通（阶跃激励，
         *    调 P 用）。g_dci_i_ref_ma 恒为最终目标，s_i_ref_ramp 为生效幅值，
         *    Start 复位 0 —— 启动即从 0 爬坡，改目标即时跟随 */
        if (g_dci_i_ramp_ma_s > 0.0f) {
            ramp_step = g_dci_i_ramp_ma_s / (float)FOC_ISR_HZ;
            if (s_i_ref_ramp < g_dci_i_ref_ma) {
                s_i_ref_ramp += ramp_step;
                if (s_i_ref_ramp > g_dci_i_ref_ma) {
                    s_i_ref_ramp = g_dci_i_ref_ma;
                }
            } else if (s_i_ref_ramp > g_dci_i_ref_ma) {
                s_i_ref_ramp -= ramp_step;
                if (s_i_ref_ramp < g_dci_i_ref_ma) {
                    s_i_ref_ramp = g_dci_i_ref_ma;
                }
            }
        } else {
            s_i_ref_ramp = g_dci_i_ref_ma;
        }
        dlt_rad = dlt * DCI_DEG2RAD;
        id_ref = (s_i_ref_ramp * 0.001f) * Foc_Math_Cos(dlt_rad);
        iq_ref = (s_i_ref_ramp * 0.001f) * Foc_Math_Sin(dlt_rad);
        g_dci_id_ref_ma = id_ref * 1000.0f;
        g_dci_iq_ref_ma = iq_ref * 1000.0f;

        /* 7. PI 电流环（I 已启用）：vd/vq = PID(ref, fb)，限幅 ±DCI_PI_UMAX_V。
         *    ki≈kp×R/L 零极点对消；调 P 时 Watch 置 g_dci_pid_*_cfg.i_valid=0 */
        vd = PID_UpdateUs(&s_pid_id, id_ref, id, FOC_ISR_DT_US);
        vq = PID_UpdateUs(&s_pid_iq, iq_ref, iq, FOC_ISR_DT_US);
        g_foc_vd = vd;
        g_foc_vq = vq;
        g_dci_vsat = ((vd <= -DCI_PI_UMAX_V + 0.01f) || (vd >= DCI_PI_UMAX_V - 0.01f) ||
                      (vq <= -DCI_PI_UMAX_V + 0.01f) || (vq >= DCI_PI_UMAX_V - 0.01f)) ? 1u : 0u;

        /* 8. 反 Park（转子角）-> SVPWM 输出 */
        cos_r = Foc_Math_Cos(rot_rad);
        sin_r = Foc_Math_Sin(rot_rad);
        valpha = vd * cos_r - vq * sin_r;
        vbeta  = vd * sin_r + vq * cos_r;
        Foc_Svpwm(valpha, vbeta, FOC_VBUS_V, &du, &dv, &dw);
        TMR4_PWM_SetDuty3Phase(du, dv, dw);

        g_foc_valpha    = valpha;
        g_foc_vbeta     = vbeta;
        g_foc_theta_rad = rot_rad;   /* RUN 控制系 = 转子系 */
        g_foc_du = du;
        g_foc_dv = dv;
        g_foc_dw = dw;
        g_dci_du = du;
        g_dci_dv = dv;
        g_dci_dw = dw;

        /* 9. 误差统计（e = ref - fb，5s 窗口无缝衔接）：
         *    mean = P-only 稳态落差；pp = 振铃/振荡指标 */
        {
            int32_t e_d_ma = (int32_t)((id_ref - id) * 1000.0f);
            int32_t e_q_ma = (int32_t)((iq_ref - iq) * 1000.0f);

            if (s_err_init == 0u) {
                s_ed_min = s_ed_max = (float)e_d_ma;
                s_eq_min = s_eq_max = (float)e_q_ma;
                s_err_init = 1u;
            } else {
                if (e_d_ma < s_ed_min) { s_ed_min = (float)e_d_ma; }
                if (e_d_ma > s_ed_max) { s_ed_max = (float)e_d_ma; }
                if (e_q_ma < s_eq_min) { s_eq_min = (float)e_q_ma; }
                if (e_q_ma > s_eq_max) { s_eq_max = (float)e_q_ma; }
            }
            s_ed_sum_ma += e_d_ma;
            s_eq_sum_ma += e_q_ma;
            if (++s_err_tick >= DCI_ERR_WIN_TICKS) {
                s_err_tick = 0u;
                g_dci_ed_mean_ma = (float)s_ed_sum_ma / (float)DCI_ERR_WIN_TICKS;
                g_dci_eq_mean_ma = (float)s_eq_sum_ma / (float)DCI_ERR_WIN_TICKS;
                g_dci_ed_pp_ma = s_ed_max - s_ed_min;
                g_dci_eq_pp_ma = s_eq_max - s_eq_min;
                s_ed_sum_ma = 0;
                s_eq_sum_ma = 0;
                s_ed_min = s_ed_max = (float)e_d_ma;   /* 新窗口从当前样本起步 */
                s_eq_min = s_eq_max = (float)e_q_ma;
            }
        }

        /* 10. 转速测量（200ms 窗口，带符号）：Hz = counts×极对数×窗口率/CPR */
        s_speed_acc += delta;
        if (++s_speed_tick >= DCI_SPEED_WIN_TICKS) {
            g_dci_speed_hz = (float)s_speed_acc * (float)FOC_POLE_PAIRS
                             * (1000.0f / (float)DCI_SPEED_WIN_MS)
                             / (float)ENCODER_CPR;
            s_speed_tick = 0u;
            s_speed_acc  = 0;
        }

        /* 11. 角度观测（整型电角度 deg）：fld = 参考电流矢量角 = rot + δ，
         *     diff = δ（参考；实际电流矢量跟踪误差看 e_d/e_q 统计） */
        fld_deg = (int32_t)((rot_rad + dlt_rad) * DCI_RAD2DEG);
        if (fld_deg >= 360) {
            fld_deg -= 360;
        }
        rot_deg = (int32_t)(rot_rad * DCI_RAD2DEG);
        dfd     = fld_deg - rot_deg;
        dfd     = 180 - Foc_Core_ModPos(180 - dfd, 360);

        g_dci_field_deg = fld_deg;
        g_dci_rotor_deg = rot_deg;
        g_dci_diff_deg  = dfd;
        break;

    case DCI_STEP_FAULT_OC:
    default:
        /* 故障/未知状态：不发波，等待主循环切模式 */
        break;
    }
}

